----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
       BatchNorm2d-5           [-1, 64, 56, 56]             128
              ReLU-6           [-1, 64, 56, 56]               0
            Conv2d-7          [-1, 128, 56, 56]           8,192
        BaseModule-8          [-1, 128, 56, 56]               0
       BatchNorm2d-9          [-1, 128, 56, 56]             256
             ReLU-10          [-1, 128, 56, 56]               0
           Conv2d-11           [-1, 32, 56, 56]          36,864
       BaseModule-12           [-1, 32, 56, 56]               0
  BottleNeckLayer-13           [-1, 96, 56, 56]               0
      BatchNorm2d-14           [-1, 96, 56, 56]             192
             ReLU-15           [-1, 96, 56, 56]               0
           Conv2d-16          [-1, 128, 56, 56]          12,288
       BaseModule-17          [-1, 128, 56, 56]               0
      BatchNorm2d-18          [-1, 128, 56, 56]             256
             ReLU-19          [-1, 128, 56, 56]               0
           Conv2d-20           [-1, 32, 56, 56]          36,864
       BaseModule-21           [-1, 32, 56, 56]               0
  BottleNeckLayer-22          [-1, 128, 56, 56]               0
      BatchNorm2d-23          [-1, 128, 56, 56]             256
             ReLU-24          [-1, 128, 56, 56]               0
           Conv2d-25          [-1, 128, 56, 56]          16,384
       BaseModule-26          [-1, 128, 56, 56]               0
      BatchNorm2d-27          [-1, 128, 56, 56]             256
             ReLU-28          [-1, 128, 56, 56]               0
           Conv2d-29           [-1, 32, 56, 56]          36,864
       BaseModule-30           [-1, 32, 56, 56]               0
  BottleNeckLayer-31          [-1, 160, 56, 56]               0
      BatchNorm2d-32          [-1, 160, 56, 56]             320
             ReLU-33          [-1, 160, 56, 56]               0
           Conv2d-34          [-1, 128, 56, 56]          20,480
       BaseModule-35          [-1, 128, 56, 56]               0
      BatchNorm2d-36          [-1, 128, 56, 56]             256
             ReLU-37          [-1, 128, 56, 56]               0
           Conv2d-38           [-1, 32, 56, 56]          36,864
       BaseModule-39           [-1, 32, 56, 56]               0
  BottleNeckLayer-40          [-1, 192, 56, 56]               0
      BatchNorm2d-41          [-1, 192, 56, 56]             384
             ReLU-42          [-1, 192, 56, 56]               0
           Conv2d-43          [-1, 128, 56, 56]          24,576
       BaseModule-44          [-1, 128, 56, 56]               0
      BatchNorm2d-45          [-1, 128, 56, 56]             256
             ReLU-46          [-1, 128, 56, 56]               0
           Conv2d-47           [-1, 32, 56, 56]          36,864
       BaseModule-48           [-1, 32, 56, 56]               0
  BottleNeckLayer-49          [-1, 224, 56, 56]               0
      BatchNorm2d-50          [-1, 224, 56, 56]             448
             ReLU-51          [-1, 224, 56, 56]               0
           Conv2d-52          [-1, 128, 56, 56]          28,672
       BaseModule-53          [-1, 128, 56, 56]               0
      BatchNorm2d-54          [-1, 128, 56, 56]             256
             ReLU-55          [-1, 128, 56, 56]               0
           Conv2d-56           [-1, 32, 56, 56]          36,864
       BaseModule-57           [-1, 32, 56, 56]               0
  BottleNeckLayer-58          [-1, 256, 56, 56]               0
      BatchNorm2d-59          [-1, 256, 56, 56]             512
             ReLU-60          [-1, 256, 56, 56]               0
           Conv2d-61          [-1, 128, 56, 56]          32,768
       BaseModule-62          [-1, 128, 56, 56]               0
        AvgPool2d-63          [-1, 128, 28, 28]               0
  TransitionLayer-64          [-1, 128, 28, 28]               0
      BatchNorm2d-65          [-1, 128, 28, 28]             256
             ReLU-66          [-1, 128, 28, 28]               0
           Conv2d-67          [-1, 128, 28, 28]          16,384
       BaseModule-68          [-1, 128, 28, 28]               0
      BatchNorm2d-69          [-1, 128, 28, 28]             256
             ReLU-70          [-1, 128, 28, 28]               0
           Conv2d-71           [-1, 32, 28, 28]          36,864
       BaseModule-72           [-1, 32, 28, 28]               0
  BottleNeckLayer-73          [-1, 160, 28, 28]               0
      BatchNorm2d-74          [-1, 160, 28, 28]             320
             ReLU-75          [-1, 160, 28, 28]               0
           Conv2d-76          [-1, 128, 28, 28]          20,480
       BaseModule-77          [-1, 128, 28, 28]               0
      BatchNorm2d-78          [-1, 128, 28, 28]             256
             ReLU-79          [-1, 128, 28, 28]               0
           Conv2d-80           [-1, 32, 28, 28]          36,864
       BaseModule-81           [-1, 32, 28, 28]               0
  BottleNeckLayer-82          [-1, 192, 28, 28]               0
      BatchNorm2d-83          [-1, 192, 28, 28]             384
             ReLU-84          [-1, 192, 28, 28]               0
           Conv2d-85          [-1, 128, 28, 28]          24,576
       BaseModule-86          [-1, 128, 28, 28]               0
      BatchNorm2d-87          [-1, 128, 28, 28]             256
             ReLU-88          [-1, 128, 28, 28]               0
           Conv2d-89           [-1, 32, 28, 28]          36,864
       BaseModule-90           [-1, 32, 28, 28]               0
  BottleNeckLayer-91          [-1, 224, 28, 28]               0
      BatchNorm2d-92          [-1, 224, 28, 28]             448
             ReLU-93          [-1, 224, 28, 28]               0
           Conv2d-94          [-1, 128, 28, 28]          28,672
       BaseModule-95          [-1, 128, 28, 28]               0
      BatchNorm2d-96          [-1, 128, 28, 28]             256
             ReLU-97          [-1, 128, 28, 28]               0
           Conv2d-98           [-1, 32, 28, 28]          36,864
       BaseModule-99           [-1, 32, 28, 28]               0
 BottleNeckLayer-100          [-1, 256, 28, 28]               0
     BatchNorm2d-101          [-1, 256, 28, 28]             512
            ReLU-102          [-1, 256, 28, 28]               0
          Conv2d-103          [-1, 128, 28, 28]          32,768
      BaseModule-104          [-1, 128, 28, 28]               0
     BatchNorm2d-105          [-1, 128, 28, 28]             256
            ReLU-106          [-1, 128, 28, 28]               0
          Conv2d-107           [-1, 32, 28, 28]          36,864
      BaseModule-108           [-1, 32, 28, 28]               0
 BottleNeckLayer-109          [-1, 288, 28, 28]               0
     BatchNorm2d-110          [-1, 288, 28, 28]             576
            ReLU-111          [-1, 288, 28, 28]               0
          Conv2d-112          [-1, 128, 28, 28]          36,864
      BaseModule-113          [-1, 128, 28, 28]               0
     BatchNorm2d-114          [-1, 128, 28, 28]             256
            ReLU-115          [-1, 128, 28, 28]               0
          Conv2d-116           [-1, 32, 28, 28]          36,864
      BaseModule-117           [-1, 32, 28, 28]               0
 BottleNeckLayer-118          [-1, 320, 28, 28]               0
     BatchNorm2d-119          [-1, 320, 28, 28]             640
            ReLU-120          [-1, 320, 28, 28]               0
          Conv2d-121          [-1, 128, 28, 28]          40,960
      BaseModule-122          [-1, 128, 28, 28]               0
     BatchNorm2d-123          [-1, 128, 28, 28]             256
            ReLU-124          [-1, 128, 28, 28]               0
          Conv2d-125           [-1, 32, 28, 28]          36,864
      BaseModule-126           [-1, 32, 28, 28]               0
 BottleNeckLayer-127          [-1, 352, 28, 28]               0
     BatchNorm2d-128          [-1, 352, 28, 28]             704
            ReLU-129          [-1, 352, 28, 28]               0
          Conv2d-130          [-1, 128, 28, 28]          45,056
      BaseModule-131          [-1, 128, 28, 28]               0
     BatchNorm2d-132          [-1, 128, 28, 28]             256
            ReLU-133          [-1, 128, 28, 28]               0
          Conv2d-134           [-1, 32, 28, 28]          36,864
      BaseModule-135           [-1, 32, 28, 28]               0
 BottleNeckLayer-136          [-1, 384, 28, 28]               0
     BatchNorm2d-137          [-1, 384, 28, 28]             768
            ReLU-138          [-1, 384, 28, 28]               0
          Conv2d-139          [-1, 128, 28, 28]          49,152
      BaseModule-140          [-1, 128, 28, 28]               0
     BatchNorm2d-141          [-1, 128, 28, 28]             256
            ReLU-142          [-1, 128, 28, 28]               0
          Conv2d-143           [-1, 32, 28, 28]          36,864
      BaseModule-144           [-1, 32, 28, 28]               0
 BottleNeckLayer-145          [-1, 416, 28, 28]               0
     BatchNorm2d-146          [-1, 416, 28, 28]             832
            ReLU-147          [-1, 416, 28, 28]               0
          Conv2d-148          [-1, 128, 28, 28]          53,248
      BaseModule-149          [-1, 128, 28, 28]               0
     BatchNorm2d-150          [-1, 128, 28, 28]             256
            ReLU-151          [-1, 128, 28, 28]               0
          Conv2d-152           [-1, 32, 28, 28]          36,864
      BaseModule-153           [-1, 32, 28, 28]               0
 BottleNeckLayer-154          [-1, 448, 28, 28]               0
     BatchNorm2d-155          [-1, 448, 28, 28]             896
            ReLU-156          [-1, 448, 28, 28]               0
          Conv2d-157          [-1, 128, 28, 28]          57,344
      BaseModule-158          [-1, 128, 28, 28]               0
     BatchNorm2d-159          [-1, 128, 28, 28]             256
            ReLU-160          [-1, 128, 28, 28]               0
          Conv2d-161           [-1, 32, 28, 28]          36,864
      BaseModule-162           [-1, 32, 28, 28]               0
 BottleNeckLayer-163          [-1, 480, 28, 28]               0
     BatchNorm2d-164          [-1, 480, 28, 28]             960
            ReLU-165          [-1, 480, 28, 28]               0
          Conv2d-166          [-1, 128, 28, 28]          61,440
      BaseModule-167          [-1, 128, 28, 28]               0
     BatchNorm2d-168          [-1, 128, 28, 28]             256
            ReLU-169          [-1, 128, 28, 28]               0
          Conv2d-170           [-1, 32, 28, 28]          36,864
      BaseModule-171           [-1, 32, 28, 28]               0
 BottleNeckLayer-172          [-1, 512, 28, 28]               0
     BatchNorm2d-173          [-1, 512, 28, 28]           1,024
            ReLU-174          [-1, 512, 28, 28]               0
          Conv2d-175          [-1, 256, 28, 28]         131,072
      BaseModule-176          [-1, 256, 28, 28]               0
       AvgPool2d-177          [-1, 256, 14, 14]               0
 TransitionLayer-178          [-1, 256, 14, 14]               0
     BatchNorm2d-179          [-1, 256, 14, 14]             512
            ReLU-180          [-1, 256, 14, 14]               0
          Conv2d-181          [-1, 128, 14, 14]          32,768
      BaseModule-182          [-1, 128, 14, 14]               0
     BatchNorm2d-183          [-1, 128, 14, 14]             256
            ReLU-184          [-1, 128, 14, 14]               0
          Conv2d-185           [-1, 32, 14, 14]          36,864
      BaseModule-186           [-1, 32, 14, 14]               0
 BottleNeckLayer-187          [-1, 288, 14, 14]               0
     BatchNorm2d-188          [-1, 288, 14, 14]             576
            ReLU-189          [-1, 288, 14, 14]               0
          Conv2d-190          [-1, 128, 14, 14]          36,864
      BaseModule-191          [-1, 128, 14, 14]               0
     BatchNorm2d-192          [-1, 128, 14, 14]             256
            ReLU-193          [-1, 128, 14, 14]               0
          Conv2d-194           [-1, 32, 14, 14]          36,864
      BaseModule-195           [-1, 32, 14, 14]               0
 BottleNeckLayer-196          [-1, 320, 14, 14]               0
     BatchNorm2d-197          [-1, 320, 14, 14]             640
            ReLU-198          [-1, 320, 14, 14]               0
          Conv2d-199          [-1, 128, 14, 14]          40,960
      BaseModule-200          [-1, 128, 14, 14]               0
     BatchNorm2d-201          [-1, 128, 14, 14]             256
            ReLU-202          [-1, 128, 14, 14]               0
          Conv2d-203           [-1, 32, 14, 14]          36,864
      BaseModule-204           [-1, 32, 14, 14]               0
 BottleNeckLayer-205          [-1, 352, 14, 14]               0
     BatchNorm2d-206          [-1, 352, 14, 14]             704
            ReLU-207          [-1, 352, 14, 14]               0
          Conv2d-208          [-1, 128, 14, 14]          45,056
      BaseModule-209          [-1, 128, 14, 14]               0
     BatchNorm2d-210          [-1, 128, 14, 14]             256
            ReLU-211          [-1, 128, 14, 14]               0
          Conv2d-212           [-1, 32, 14, 14]          36,864
      BaseModule-213           [-1, 32, 14, 14]               0
 BottleNeckLayer-214          [-1, 384, 14, 14]               0
     BatchNorm2d-215          [-1, 384, 14, 14]             768
            ReLU-216          [-1, 384, 14, 14]               0
          Conv2d-217          [-1, 128, 14, 14]          49,152
      BaseModule-218          [-1, 128, 14, 14]               0
     BatchNorm2d-219          [-1, 128, 14, 14]             256
            ReLU-220          [-1, 128, 14, 14]               0
          Conv2d-221           [-1, 32, 14, 14]          36,864
      BaseModule-222           [-1, 32, 14, 14]               0
 BottleNeckLayer-223          [-1, 416, 14, 14]               0
     BatchNorm2d-224          [-1, 416, 14, 14]             832
            ReLU-225          [-1, 416, 14, 14]               0
          Conv2d-226          [-1, 128, 14, 14]          53,248
      BaseModule-227          [-1, 128, 14, 14]               0
     BatchNorm2d-228          [-1, 128, 14, 14]             256
            ReLU-229          [-1, 128, 14, 14]               0
          Conv2d-230           [-1, 32, 14, 14]          36,864
      BaseModule-231           [-1, 32, 14, 14]               0
 BottleNeckLayer-232          [-1, 448, 14, 14]               0
     BatchNorm2d-233          [-1, 448, 14, 14]             896
            ReLU-234          [-1, 448, 14, 14]               0
          Conv2d-235          [-1, 128, 14, 14]          57,344
      BaseModule-236          [-1, 128, 14, 14]               0
     BatchNorm2d-237          [-1, 128, 14, 14]             256
            ReLU-238          [-1, 128, 14, 14]               0
          Conv2d-239           [-1, 32, 14, 14]          36,864
      BaseModule-240           [-1, 32, 14, 14]               0
 BottleNeckLayer-241          [-1, 480, 14, 14]               0
     BatchNorm2d-242          [-1, 480, 14, 14]             960
            ReLU-243          [-1, 480, 14, 14]               0
          Conv2d-244          [-1, 128, 14, 14]          61,440
      BaseModule-245          [-1, 128, 14, 14]               0
     BatchNorm2d-246          [-1, 128, 14, 14]             256
            ReLU-247          [-1, 128, 14, 14]               0
          Conv2d-248           [-1, 32, 14, 14]          36,864
      BaseModule-249           [-1, 32, 14, 14]               0
 BottleNeckLayer-250          [-1, 512, 14, 14]               0
     BatchNorm2d-251          [-1, 512, 14, 14]           1,024
            ReLU-252          [-1, 512, 14, 14]               0
          Conv2d-253          [-1, 128, 14, 14]          65,536
      BaseModule-254          [-1, 128, 14, 14]               0
     BatchNorm2d-255          [-1, 128, 14, 14]             256
            ReLU-256          [-1, 128, 14, 14]               0
          Conv2d-257           [-1, 32, 14, 14]          36,864
      BaseModule-258           [-1, 32, 14, 14]               0
 BottleNeckLayer-259          [-1, 544, 14, 14]               0
     BatchNorm2d-260          [-1, 544, 14, 14]           1,088
            ReLU-261          [-1, 544, 14, 14]               0
          Conv2d-262          [-1, 128, 14, 14]          69,632
      BaseModule-263          [-1, 128, 14, 14]               0
     BatchNorm2d-264          [-1, 128, 14, 14]             256
            ReLU-265          [-1, 128, 14, 14]               0
          Conv2d-266           [-1, 32, 14, 14]          36,864
      BaseModule-267           [-1, 32, 14, 14]               0
 BottleNeckLayer-268          [-1, 576, 14, 14]               0
     BatchNorm2d-269          [-1, 576, 14, 14]           1,152
            ReLU-270          [-1, 576, 14, 14]               0
          Conv2d-271          [-1, 128, 14, 14]          73,728
      BaseModule-272          [-1, 128, 14, 14]               0
     BatchNorm2d-273          [-1, 128, 14, 14]             256
            ReLU-274          [-1, 128, 14, 14]               0
          Conv2d-275           [-1, 32, 14, 14]          36,864
      BaseModule-276           [-1, 32, 14, 14]               0
 BottleNeckLayer-277          [-1, 608, 14, 14]               0
     BatchNorm2d-278          [-1, 608, 14, 14]           1,216
            ReLU-279          [-1, 608, 14, 14]               0
          Conv2d-280          [-1, 128, 14, 14]          77,824
      BaseModule-281          [-1, 128, 14, 14]               0
     BatchNorm2d-282          [-1, 128, 14, 14]             256
            ReLU-283          [-1, 128, 14, 14]               0
          Conv2d-284           [-1, 32, 14, 14]          36,864
      BaseModule-285           [-1, 32, 14, 14]               0
 BottleNeckLayer-286          [-1, 640, 14, 14]               0
     BatchNorm2d-287          [-1, 640, 14, 14]           1,280
            ReLU-288          [-1, 640, 14, 14]               0
          Conv2d-289          [-1, 128, 14, 14]          81,920
      BaseModule-290          [-1, 128, 14, 14]               0
     BatchNorm2d-291          [-1, 128, 14, 14]             256
            ReLU-292          [-1, 128, 14, 14]               0
          Conv2d-293           [-1, 32, 14, 14]          36,864
      BaseModule-294           [-1, 32, 14, 14]               0
 BottleNeckLayer-295          [-1, 672, 14, 14]               0
     BatchNorm2d-296          [-1, 672, 14, 14]           1,344
            ReLU-297          [-1, 672, 14, 14]               0
          Conv2d-298          [-1, 128, 14, 14]          86,016
      BaseModule-299          [-1, 128, 14, 14]               0
     BatchNorm2d-300          [-1, 128, 14, 14]             256
            ReLU-301          [-1, 128, 14, 14]               0
          Conv2d-302           [-1, 32, 14, 14]          36,864
      BaseModule-303           [-1, 32, 14, 14]               0
 BottleNeckLayer-304          [-1, 704, 14, 14]               0
     BatchNorm2d-305          [-1, 704, 14, 14]           1,408
            ReLU-306          [-1, 704, 14, 14]               0
          Conv2d-307          [-1, 128, 14, 14]          90,112
      BaseModule-308          [-1, 128, 14, 14]               0
     BatchNorm2d-309          [-1, 128, 14, 14]             256
            ReLU-310          [-1, 128, 14, 14]               0
          Conv2d-311           [-1, 32, 14, 14]          36,864
      BaseModule-312           [-1, 32, 14, 14]               0
 BottleNeckLayer-313          [-1, 736, 14, 14]               0
     BatchNorm2d-314          [-1, 736, 14, 14]           1,472
            ReLU-315          [-1, 736, 14, 14]               0
          Conv2d-316          [-1, 128, 14, 14]          94,208
      BaseModule-317          [-1, 128, 14, 14]               0
     BatchNorm2d-318          [-1, 128, 14, 14]             256
            ReLU-319          [-1, 128, 14, 14]               0
          Conv2d-320           [-1, 32, 14, 14]          36,864
      BaseModule-321           [-1, 32, 14, 14]               0
 BottleNeckLayer-322          [-1, 768, 14, 14]               0
     BatchNorm2d-323          [-1, 768, 14, 14]           1,536
            ReLU-324          [-1, 768, 14, 14]               0
          Conv2d-325          [-1, 128, 14, 14]          98,304
      BaseModule-326          [-1, 128, 14, 14]               0
     BatchNorm2d-327          [-1, 128, 14, 14]             256
            ReLU-328          [-1, 128, 14, 14]               0
          Conv2d-329           [-1, 32, 14, 14]          36,864
      BaseModule-330           [-1, 32, 14, 14]               0
 BottleNeckLayer-331          [-1, 800, 14, 14]               0
     BatchNorm2d-332          [-1, 800, 14, 14]           1,600
            ReLU-333          [-1, 800, 14, 14]               0
          Conv2d-334          [-1, 128, 14, 14]         102,400
      BaseModule-335          [-1, 128, 14, 14]               0
     BatchNorm2d-336          [-1, 128, 14, 14]             256
            ReLU-337          [-1, 128, 14, 14]               0
          Conv2d-338           [-1, 32, 14, 14]          36,864
      BaseModule-339           [-1, 32, 14, 14]               0
 BottleNeckLayer-340          [-1, 832, 14, 14]               0
     BatchNorm2d-341          [-1, 832, 14, 14]           1,664
            ReLU-342          [-1, 832, 14, 14]               0
          Conv2d-343          [-1, 128, 14, 14]         106,496
      BaseModule-344          [-1, 128, 14, 14]               0
     BatchNorm2d-345          [-1, 128, 14, 14]             256
            ReLU-346          [-1, 128, 14, 14]               0
          Conv2d-347           [-1, 32, 14, 14]          36,864
      BaseModule-348           [-1, 32, 14, 14]               0
 BottleNeckLayer-349          [-1, 864, 14, 14]               0
     BatchNorm2d-350          [-1, 864, 14, 14]           1,728
            ReLU-351          [-1, 864, 14, 14]               0
          Conv2d-352          [-1, 128, 14, 14]         110,592
      BaseModule-353          [-1, 128, 14, 14]               0
     BatchNorm2d-354          [-1, 128, 14, 14]             256
            ReLU-355          [-1, 128, 14, 14]               0
          Conv2d-356           [-1, 32, 14, 14]          36,864
      BaseModule-357           [-1, 32, 14, 14]               0
 BottleNeckLayer-358          [-1, 896, 14, 14]               0
     BatchNorm2d-359          [-1, 896, 14, 14]           1,792
            ReLU-360          [-1, 896, 14, 14]               0
          Conv2d-361          [-1, 128, 14, 14]         114,688
      BaseModule-362          [-1, 128, 14, 14]               0
     BatchNorm2d-363          [-1, 128, 14, 14]             256
            ReLU-364          [-1, 128, 14, 14]               0
          Conv2d-365           [-1, 32, 14, 14]          36,864
      BaseModule-366           [-1, 32, 14, 14]               0
 BottleNeckLayer-367          [-1, 928, 14, 14]               0
     BatchNorm2d-368          [-1, 928, 14, 14]           1,856
            ReLU-369          [-1, 928, 14, 14]               0
          Conv2d-370          [-1, 128, 14, 14]         118,784
      BaseModule-371          [-1, 128, 14, 14]               0
     BatchNorm2d-372          [-1, 128, 14, 14]             256
            ReLU-373          [-1, 128, 14, 14]               0
          Conv2d-374           [-1, 32, 14, 14]          36,864
      BaseModule-375           [-1, 32, 14, 14]               0
 BottleNeckLayer-376          [-1, 960, 14, 14]               0
     BatchNorm2d-377          [-1, 960, 14, 14]           1,920
            ReLU-378          [-1, 960, 14, 14]               0
          Conv2d-379          [-1, 128, 14, 14]         122,880
      BaseModule-380          [-1, 128, 14, 14]               0
     BatchNorm2d-381          [-1, 128, 14, 14]             256
            ReLU-382          [-1, 128, 14, 14]               0
          Conv2d-383           [-1, 32, 14, 14]          36,864
      BaseModule-384           [-1, 32, 14, 14]               0
 BottleNeckLayer-385          [-1, 992, 14, 14]               0
     BatchNorm2d-386          [-1, 992, 14, 14]           1,984
            ReLU-387          [-1, 992, 14, 14]               0
          Conv2d-388          [-1, 128, 14, 14]         126,976
      BaseModule-389          [-1, 128, 14, 14]               0
     BatchNorm2d-390          [-1, 128, 14, 14]             256
            ReLU-391          [-1, 128, 14, 14]               0
          Conv2d-392           [-1, 32, 14, 14]          36,864
      BaseModule-393           [-1, 32, 14, 14]               0
 BottleNeckLayer-394         [-1, 1024, 14, 14]               0
     BatchNorm2d-395         [-1, 1024, 14, 14]           2,048
            ReLU-396         [-1, 1024, 14, 14]               0
          Conv2d-397          [-1, 512, 14, 14]         524,288
      BaseModule-398          [-1, 512, 14, 14]               0
       AvgPool2d-399            [-1, 512, 7, 7]               0
 TransitionLayer-400            [-1, 512, 7, 7]               0
     BatchNorm2d-401            [-1, 512, 7, 7]           1,024
            ReLU-402            [-1, 512, 7, 7]               0
          Conv2d-403            [-1, 128, 7, 7]          65,536
      BaseModule-404            [-1, 128, 7, 7]               0
     BatchNorm2d-405            [-1, 128, 7, 7]             256
            ReLU-406            [-1, 128, 7, 7]               0
          Conv2d-407             [-1, 32, 7, 7]          36,864
      BaseModule-408             [-1, 32, 7, 7]               0
 BottleNeckLayer-409            [-1, 544, 7, 7]               0
     BatchNorm2d-410            [-1, 544, 7, 7]           1,088
            ReLU-411            [-1, 544, 7, 7]               0
          Conv2d-412            [-1, 128, 7, 7]          69,632
      BaseModule-413            [-1, 128, 7, 7]               0
     BatchNorm2d-414            [-1, 128, 7, 7]             256
            ReLU-415            [-1, 128, 7, 7]               0
          Conv2d-416             [-1, 32, 7, 7]          36,864
      BaseModule-417             [-1, 32, 7, 7]               0
 BottleNeckLayer-418            [-1, 576, 7, 7]               0
     BatchNorm2d-419            [-1, 576, 7, 7]           1,152
            ReLU-420            [-1, 576, 7, 7]               0
          Conv2d-421            [-1, 128, 7, 7]          73,728
      BaseModule-422            [-1, 128, 7, 7]               0
     BatchNorm2d-423            [-1, 128, 7, 7]             256
            ReLU-424            [-1, 128, 7, 7]               0
          Conv2d-425             [-1, 32, 7, 7]          36,864
      BaseModule-426             [-1, 32, 7, 7]               0
 BottleNeckLayer-427            [-1, 608, 7, 7]               0
     BatchNorm2d-428            [-1, 608, 7, 7]           1,216
            ReLU-429            [-1, 608, 7, 7]               0
          Conv2d-430            [-1, 128, 7, 7]          77,824
      BaseModule-431            [-1, 128, 7, 7]               0
     BatchNorm2d-432            [-1, 128, 7, 7]             256
            ReLU-433            [-1, 128, 7, 7]               0
          Conv2d-434             [-1, 32, 7, 7]          36,864
      BaseModule-435             [-1, 32, 7, 7]               0
 BottleNeckLayer-436            [-1, 640, 7, 7]               0
     BatchNorm2d-437            [-1, 640, 7, 7]           1,280
            ReLU-438            [-1, 640, 7, 7]               0
          Conv2d-439            [-1, 128, 7, 7]          81,920
      BaseModule-440            [-1, 128, 7, 7]               0
     BatchNorm2d-441            [-1, 128, 7, 7]             256
            ReLU-442            [-1, 128, 7, 7]               0
          Conv2d-443             [-1, 32, 7, 7]          36,864
      BaseModule-444             [-1, 32, 7, 7]               0
 BottleNeckLayer-445            [-1, 672, 7, 7]               0
     BatchNorm2d-446            [-1, 672, 7, 7]           1,344
            ReLU-447            [-1, 672, 7, 7]               0
          Conv2d-448            [-1, 128, 7, 7]          86,016
      BaseModule-449            [-1, 128, 7, 7]               0
     BatchNorm2d-450            [-1, 128, 7, 7]             256
            ReLU-451            [-1, 128, 7, 7]               0
          Conv2d-452             [-1, 32, 7, 7]          36,864
      BaseModule-453             [-1, 32, 7, 7]               0
 BottleNeckLayer-454            [-1, 704, 7, 7]               0
     BatchNorm2d-455            [-1, 704, 7, 7]           1,408
            ReLU-456            [-1, 704, 7, 7]               0
          Conv2d-457            [-1, 128, 7, 7]          90,112
      BaseModule-458            [-1, 128, 7, 7]               0
     BatchNorm2d-459            [-1, 128, 7, 7]             256
            ReLU-460            [-1, 128, 7, 7]               0
          Conv2d-461             [-1, 32, 7, 7]          36,864
      BaseModule-462             [-1, 32, 7, 7]               0
 BottleNeckLayer-463            [-1, 736, 7, 7]               0
     BatchNorm2d-464            [-1, 736, 7, 7]           1,472
            ReLU-465            [-1, 736, 7, 7]               0
          Conv2d-466            [-1, 128, 7, 7]          94,208
      BaseModule-467            [-1, 128, 7, 7]               0
     BatchNorm2d-468            [-1, 128, 7, 7]             256
            ReLU-469            [-1, 128, 7, 7]               0
          Conv2d-470             [-1, 32, 7, 7]          36,864
      BaseModule-471             [-1, 32, 7, 7]               0
 BottleNeckLayer-472            [-1, 768, 7, 7]               0
     BatchNorm2d-473            [-1, 768, 7, 7]           1,536
            ReLU-474            [-1, 768, 7, 7]               0
          Conv2d-475            [-1, 128, 7, 7]          98,304
      BaseModule-476            [-1, 128, 7, 7]               0
     BatchNorm2d-477            [-1, 128, 7, 7]             256
            ReLU-478            [-1, 128, 7, 7]               0
          Conv2d-479             [-1, 32, 7, 7]          36,864
      BaseModule-480             [-1, 32, 7, 7]               0
 BottleNeckLayer-481            [-1, 800, 7, 7]               0
     BatchNorm2d-482            [-1, 800, 7, 7]           1,600
            ReLU-483            [-1, 800, 7, 7]               0
          Conv2d-484            [-1, 128, 7, 7]         102,400
      BaseModule-485            [-1, 128, 7, 7]               0
     BatchNorm2d-486            [-1, 128, 7, 7]             256
            ReLU-487            [-1, 128, 7, 7]               0
          Conv2d-488             [-1, 32, 7, 7]          36,864
      BaseModule-489             [-1, 32, 7, 7]               0
 BottleNeckLayer-490            [-1, 832, 7, 7]               0
     BatchNorm2d-491            [-1, 832, 7, 7]           1,664
            ReLU-492            [-1, 832, 7, 7]               0
          Conv2d-493            [-1, 128, 7, 7]         106,496
      BaseModule-494            [-1, 128, 7, 7]               0
     BatchNorm2d-495            [-1, 128, 7, 7]             256
            ReLU-496            [-1, 128, 7, 7]               0
          Conv2d-497             [-1, 32, 7, 7]          36,864
      BaseModule-498             [-1, 32, 7, 7]               0
 BottleNeckLayer-499            [-1, 864, 7, 7]               0
     BatchNorm2d-500            [-1, 864, 7, 7]           1,728
            ReLU-501            [-1, 864, 7, 7]               0
          Conv2d-502            [-1, 128, 7, 7]         110,592
      BaseModule-503            [-1, 128, 7, 7]               0
     BatchNorm2d-504            [-1, 128, 7, 7]             256
            ReLU-505            [-1, 128, 7, 7]               0
          Conv2d-506             [-1, 32, 7, 7]          36,864
      BaseModule-507             [-1, 32, 7, 7]               0
 BottleNeckLayer-508            [-1, 896, 7, 7]               0
     BatchNorm2d-509            [-1, 896, 7, 7]           1,792
            ReLU-510            [-1, 896, 7, 7]               0
          Conv2d-511            [-1, 128, 7, 7]         114,688
      BaseModule-512            [-1, 128, 7, 7]               0
     BatchNorm2d-513            [-1, 128, 7, 7]             256
            ReLU-514            [-1, 128, 7, 7]               0
          Conv2d-515             [-1, 32, 7, 7]          36,864
      BaseModule-516             [-1, 32, 7, 7]               0
 BottleNeckLayer-517            [-1, 928, 7, 7]               0
     BatchNorm2d-518            [-1, 928, 7, 7]           1,856
            ReLU-519            [-1, 928, 7, 7]               0
          Conv2d-520            [-1, 128, 7, 7]         118,784
      BaseModule-521            [-1, 128, 7, 7]               0
     BatchNorm2d-522            [-1, 128, 7, 7]             256
            ReLU-523            [-1, 128, 7, 7]               0
          Conv2d-524             [-1, 32, 7, 7]          36,864
      BaseModule-525             [-1, 32, 7, 7]               0
 BottleNeckLayer-526            [-1, 960, 7, 7]               0
     BatchNorm2d-527            [-1, 960, 7, 7]           1,920
            ReLU-528            [-1, 960, 7, 7]               0
          Conv2d-529            [-1, 128, 7, 7]         122,880
      BaseModule-530            [-1, 128, 7, 7]               0
     BatchNorm2d-531            [-1, 128, 7, 7]             256
            ReLU-532            [-1, 128, 7, 7]               0
          Conv2d-533             [-1, 32, 7, 7]          36,864
      BaseModule-534             [-1, 32, 7, 7]               0
 BottleNeckLayer-535            [-1, 992, 7, 7]               0
     BatchNorm2d-536            [-1, 992, 7, 7]           1,984
            ReLU-537            [-1, 992, 7, 7]               0
          Conv2d-538            [-1, 128, 7, 7]         126,976
      BaseModule-539            [-1, 128, 7, 7]               0
     BatchNorm2d-540            [-1, 128, 7, 7]             256
            ReLU-541            [-1, 128, 7, 7]               0
          Conv2d-542             [-1, 32, 7, 7]          36,864
      BaseModule-543             [-1, 32, 7, 7]               0
 BottleNeckLayer-544           [-1, 1024, 7, 7]               0
       AvgPool2d-545           [-1, 1024, 1, 1]               0
          Linear-546                       [-1]       2,049,000
================================================================
Total params: 9,000,808
Trainable params: 9,000,808
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 419.28
Params size (MB): 34.34
Estimated Total Size (MB): 454.19
----------------------------------------------------------------